grevaillot/svd_tools/headers/STM32L4S7/memorymap.h
#pragma once 

#define TIM2_BASE			(0x40000000)
#define TIM3_BASE			(0x40000400)
#define TIM4_BASE			(0x40000800)
#define TIM5_BASE			(0x40000c00)
#define TIM6_BASE			(0x40001000)
#define TIM7_BASE			(0x40001400)
#define RTC_BASE			(0x40002800)
#define WWDG_BASE			(0x40002c00)
#define IWDG_BASE			(0x40003000)
#define SPI2_BASE			(0x40003800)
#define SPI3_BASE			(0x40003c00)
#define USART2_BASE			(0x40004400)
#define USART3_BASE			(0x40004800)
#define UART4_BASE			(0x40004c00)
#define UART5_BASE			(0x40005000)
#define I2C1_BASE			(0x40005400)
#define I2C2_BASE			(0x40005800)
#define I2C3_BASE			(0x40005c00)
#define CRS_BASE			(0x40006000)
#define CAN1_BASE			(0x40006400)
#define PWR_BASE			(0x40007000)
#define DAC_BASE			(0x40007400)
#define OPAMP_BASE			(0x40007800)
#define LPTIM1_BASE			(0x40007c00)
#define LPUART1_BASE			(0x40008000)
#define I2C4_BASE			(0x40008400)
#define SWPMI1_BASE			(0x40008800)
#define LPTIM2_BASE			(0x40009400)
#define SYSCFG_BASE			(0x40010000)
#define VREFBUF_BASE			(0x40010030)
#define COMP_BASE			(0x40010200)
#define EXTI_BASE			(0x40010400)
#define FIREWALL_BASE			(0x40011c00)
#define TIM1_BASE			(0x40012c00)
#define SPI1_BASE			(0x40013000)
#define TIM8_BASE			(0x40013400)
#define USART1_BASE			(0x40013800)
#define TIM15_BASE			(0x40014000)
#define TIM16_BASE			(0x40014400)
#define TIM17_BASE			(0x40014800)
#define SAI1_BASE			(0x40015400)
#define SAI2_BASE			(0x40015800)
#define DFSDM1_BASE			(0x40016000)
#define LTCD_BASE			(0x40016800)
#define DSI_BASE			(0x40016c00)
#define DMA1_BASE			(0x40020000)
#define DMA2_BASE			(0x40020400)
#define RCC_BASE			(0x40021000)
#define FLASH_BASE			(0x40022000)
#define CRC_BASE			(0x40023000)
#define TSC_BASE			(0x40024000)
#define DMA2D_BASE			(0x4002b000)
#define GFXMMU_BASE			(0x4002c000)
#define GPIOA_BASE			(0x48000000)
#define GPIOB_BASE			(0x48000400)
#define GPIOC_BASE			(0x48000800)
#define GPIOD_BASE			(0x48000c00)
#define GPIOE_BASE			(0x48001000)
#define GPIOF_BASE			(0x48001400)
#define GPIOG_BASE			(0x48001800)
#define GPIOH_BASE			(0x48001c00)
#define GPIOI_BASE			(0x48002000)
#define OTG_FS_GLOBAL_BASE			(0x50000000)
#define OTG_FS_HOST_BASE			(0x50000400)
#define OTG_FS_DEVICE_BASE			(0x50000800)
#define OTG_FS_PWRCLK_BASE			(0x50000e00)
#define ADC_BASE			(0x50040000)
#define ADC_Common_BASE			(0x50040300)
#define DCMI_BASE			(0x50050000)
#define AES_BASE			(0x50060000)
#define HASH_BASE			(0x50060400)
#define RNG_BASE			(0x50060800)
#define OCTOSPIM_BASE			(0x50061c00)
#define SDMMC1_BASE			(0x50062400)
#define FMC_BASE			(0xa0000000)
#define OCTOSPI1_BASE			(0xa0001000)
#define OCTOSPI2_BASE			(0xa0001400)
#define SCB_ACTRL_BASE			(0xe000e008)
#define STK_BASE			(0xe000e010)
#define NVIC_BASE			(0xe000e100)
#define SCB_BASE			(0xe000ed00)
#define FPU_CPACR_BASE			(0xe000ed88)
#define MPU_BASE			(0xe000ed90)
#define NVIC_STIR_BASE			(0xe000ef00)
#define FPU_BASE			(0xe000ef34)
#define DBGMCU_BASE			(0xe0042000)
